tap "caarlos0/tap", trusted: true
tap "goreleaser/tap", trusted: true
tap "homebrew/bundle"
tap "orlangure/tap", trusted: true
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Command-line tool for formatting Nix Code
brew "alejandra"
# Command-line interface for SQLite
brew "sqlite"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Record and share terminal sessions
brew "asciinema"
# Language Server for Bash
brew "bash-language-server"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Run arbitrary commands when files change
brew "entr"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Fast, disk space efficient package manager
brew "pnpm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Show ps output as a tree
brew "pstree"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Autoformat shell script source code
brew "shfmt"
# Non-interactive SSH password auth
brew "sshpass"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Opinionated Lua code formatter
brew "stylua"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# TOML toolkit written in Rust
brew "taplo"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Language Server for Yaml Files
brew "yaml-language-server"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Go Coverage in your terminal: a tool for exploring Go Coverage reports from the command line
brew "orlangure/tap/gocovsh"
# Application uninstaller
cask "appcleaner"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Screen capturing tool
cask "cleanshot"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli@prerelease"
# Presentations from Markdown
cask "deckset"
# Voice and text chat software
cask "discord"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Release engineering, simplified.
cask "goreleaser/tap/goreleaser-pro"
# Desktop automation application
cask "hammerspoon"
# Tool to optimise images to a smaller size
cask "imageoptim"
# GoReleaser MCP server
cask "goreleaser/tap/mcp"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Tool to create text-based art
cask "monodraw"
# Replacement for Docker Desktop
cask "orbstack"
# GitHub Actions pinner.
cask "caarlos0/tap/pinata"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Hardware-accelerated GPU terminal emulator
cask "rio"
# Team communication and collaboration software
cask "slack"
# Notepad with a built-in calculator
cask "soulver"
# Semantic Version Utility
cask "caarlos0/tap/svu"
# Messaging app with a focus on speed and security
cask "telegram"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Connect to Windows
cask "windows-app"
# Gecko based web browser
cask "zen"
mas "Azure VPN Client", id: 1553936137
mas "Control Panel for Twitter", id: 1668516167
mas "Control Panel for YouTube", id: 6478456678
mas "Debit & Credit", id: 882637653
mas "HEIC Converter", id: 1294126402
mas "Infuse", id: 1136220934
mas "Keynote", id: 361285480
mas "Lungo", id: 1263070803
mas "Numbers", id: 361304891
mas "Okta Extension App", id: 1439967473
mas "Okta Verify", id: 490179405
mas "Pages", id: 361309726
mas "Parcel", id: 375589283
mas "Reeder", id: 1529448980
mas "Tailscale", id: 1475387142
